#define _CRT_SECURE_NO_WARNINGS

// (一).字符指针
// (二).指针数组
// (三).数组指针
// (四).数组传参和指针传参
// (五).函数指针
// (六).函数指针数组
// (七).指向函数指针数组的指针
// (八).回调函数
// (九).指针和数组面试题目的解析

// ##########################################################
// (三): 数组指针
// ##########################################################

// 数组指针 -- 指针,是一种指向数组的指针
// 整型指针 --- 指向整型的指针
// 数组指针 --- 指向数组的指针

// int* p1[10];      // p1是int* [10]类型的; p1是指针数组
//                   // p1和[]先结合，说明p1是一个数组，数组中的每一个元素都是int*类型的

// int (*p2)[10];    // *p2说明p2是指针，p2可以指向是数组(该数组有10个元素，每个元素是int类型)
//                   // p2和*先结合,说明p2是一个指针,该指针指向的是一个数组,该数组有10个int类型的元素

// []的优先级高于*，所以int* p1[10]是指针数组，int (*p2)[10]是数组指针

// ==========================================================
// (1): 数组名和 &数组名
// ==========================================================

// 数组名通常表示的都是首元素的地址
// 但是有2个例外:
//   1. sizeof(arr),这里的数组名是整个数组,计算的是整个数组的大小,单位是字节;
//   2. &数组名,这里的数组名表示的依然是整个数组,所以&数组名取出的是整个数组的地址

#include <stdio.h>
int main4()
{
    int arr[10] = { 0 };

    // 数组名arr表示首元素地址
    printf("%p\n", arr);     // arr的类型: int*
    printf("%p\n", arr + 1); // arr+1跳过4个字节（一个int的大小）

    printf("------------------------\n");

    // 首元素地址 &arr[0]
    printf("%p\n", &arr[0]);     // &arr[0]的类型int*
    printf("%p\n", &arr[0] + 1); // &arr[0]+1也是跳过4个字节

    printf("------------------------\n");

    // &arr 表示整个数组的地址
    printf("%p\n", &arr);     // &arr的类型是: int (*)[10]
    printf("%p\n", &arr + 1); // 跳过40个字节(整个数组的大小:10*4=40字节)

    printf("------------------------\n");

    // sizeof(arr) 计算整个数组的大小
    int len = sizeof(arr);
    printf("%d\n", len);

    // 指针变量存储地址
    int* p1 = arr;        // 把首元素的地址存入到p1中(整型指针)
    int (*p2)[10] = &arr; // 数组指针就是用来存放数组的地址的;

    // p2的类型是: int (*)[10] 数组指针的类型
    // 整型指针,是用来存放整型变量的地址的
    // 字符指针,是用来存放字符变量的地址的
    // 数组指针,是用来存放数组的地址的

    return 0;
}

// ==========================================================
// (2): 数组指针的定义和使用
// ==========================================================

#include <stdio.h>
int main5()
{
    // 字符指针数组
    char* arr[5] = { 0 };

    // 数组指针指向字符指针数组
    char* (*pc)[5] = &arr; // (*pc)[5]表示pc所指向5个元素,每个元素是char*类型;
    // 数组是用来存放元素的,数组指针是用来存放数组的地址的

    // 二级指针示例
    char ch = 'a';
    char* p1 = &ch;  // p1是一级指针,存放的是ch的地址
    char** p2 = &p1; // p2是二级指针,存放的是一级指针变量的地址

    return 0;
}

// ==========================================================
// (3): 使用数组指针遍历一维数组
// ==========================================================

#include <stdio.h>
int main6()
{
    int arr[] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 };
    int (*p)[10] = &arr; // 10不能够省略掉;

    // 使用p(数组指针)遍历数组的元素
    int i = 0;
    int len = sizeof(arr) / sizeof(arr[0]);

    for (i = 0; i < 10; i++)
    {
        printf("%d ", *(*p + i));
        // p是指向数组的，*p其实就相当于数组名; 数组名相当于首元素的地址,
        // *p本质上就是数组首元素的地址;

        // 下面三种写法是等价的:
        // printf("%d ", arr[i]);
        // printf("%d ", *(*p + i));
        // printf("%d ", (*p)[i]);
    }

    printf("\n");

    // 更加常见，更加简单的写法
    int* p1 = arr;
    for (i = 0; i < len; i++)
    {
        printf("%d ", *(p1 + i));
    }

    return 0;
}

// ==========================================================
// (4): 使用数组指针遍历二维数组
// ==========================================================

#include <stdio.h>

// 数组作为函数参数传递,传递的是数组的首元素的地址
void print1(int arr[3][5], int row, int col)
{
    int i = 0;
    int j = 0;
    for (i = 0; i < row; i++)
    {
        for (j = 0; j < col; j++)
        {
            printf("%d ", arr[i][j]);
        }
        printf("\n");
    }
}

// 使用数组指针作为函数参数传递,传递数组的地址
void print2(int (*p)[5], int row, int col)
{
    int i = 0;
    int j = 0;
    for (i = 0; i < row; i++)
    {
        for (j = 0; j < col; j++)
        {
            // printf("%d ", *(*(p + i) + j));
            // p+i表示第i行的地址,
            // *(p+i)表示第i行的首元素的地址,相当于arr[0], arr[1], arr[2]
            printf("%d ", p[i][j]); // *(p+i)就等于p[i]

            // 下面三种写法是等价的
            // p[i][j]
            // *( *(p+i) + j)
            // *(p[i]+j)
        }
        printf("\n");
    }
}

int main()
{
    int arr[3][5] = { 1, 2, 3, 4, 5, 2, 3, 4, 5, 61, 5, 7, 8, 9, 10 };
    // arr数组名表示数组首元素的地址,二维数组的首元素是它的第一行,arr[0] = { 1,2,3,4,5 };
    // arr表示第一行的地址,第一行也就是: 五个整型的元素的形成一维数组的地址;
    // arr的类型是: int (*)[5]

    print1(arr, 3, 5);
    printf("---------------------\n");
    print2(arr, 3, 5);

    return 0;
}

// ==========================================================
// 数组指针总结
// ==========================================================

// int (*p)[5];
// p的类型是: int(*)[5]
// p指向的是一个整型数组的,数组5个元素,int [5]
// p+1跳过一个5个int元素的数组

// int arr[10];
// int (*p)[10] = &arr;
// &arr的类型: int(*)[10]

// int* p2 = arr;
// arr(数组名)的类型: int*
// p2+1 ---> 跳过一个整型;

// ==========================================================
// 不同类型定义总结
// ==========================================================

// int arr[10];              // arr是整型数组
// int* arr1[10];            // arr1是整型指针数组
// int (*parr2)[10];         // parr2是数组指针
// int (*parr3[10])[5];      // parr3是一个存放数组指针的数组(这个数组10个元素,每一个元素都是一个指针数组)

// parr3是一个包含10个数组指针的数组,其中每个指针都指向一个包含5个整型元素的数组.
// 也就是说,parr3本身是数组,其元素是指针,这些指针分别指向不同的5个int的数组.
